DataProcessors/ТТМ_РазмещениеНоменклатурыПоСкладскимЯчейкам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ТТМ_РазмещениеНоменклатурыПоСкладскимЯчейкам</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСклада</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительноеСведение</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ДополнительныеСведения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ДополнительныеСведения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Свойство</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ТТМ_РазмещениеНоменклатурыПоСкладскимЯчейкам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ТТМ_РазмещениеНоменклатурыПоСкладскимЯчейкам</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОсновнаяЯчейка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ячейка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТТМ_СкладскиеЯчейки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/ТТМ_СкладскиеЯчейки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ТТМ_СкладскиеЯчейки</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Склады</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КодСклада</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЯчейки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/ТТМ_РазмещениеНоменклатурыПоСкладскимЯчейкам/Ext/ObjectModule.bsl
Функция СведенияОВнешнейОбработке() Экспорт
	
	ВерсияБСП = СтандартныеПодсистемыСервер.ВерсияБиблиотеки();
	ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке(ВерсияБСП);     //("2.2.2.1");
	ПараметрыЭтойОбработки = ПолучитьПараметрыЭтойОбработки(Ложь);
	
	ПараметрыРегистрации.Вид = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительнаяОбработка();
	ПараметрыРегистрации.Информация = ПараметрыЭтойОбработки.Комментарий
	+ ?(ЗначениеЗаполнено(ПараметрыЭтойОбработки.Комментарий), Символы.ПС, "")
	+ "Дата создания: 01.01.2020." + Символы.ПС
	+ "Дата последнего редактирования: 01.02.2020.";
	ПараметрыРегистрации.Версия = "1.0.0.1";
	ПараметрыРегистрации.БезопасныйРежим = Истина; // отключаем безопасный режим только при необходимости
	НоваяКоманда = ПараметрыРегистрации.Команды.Добавить();
	НоваяКоманда.Представление = ПараметрыЭтойОбработки.Синоним + " (настройки)";
	НоваяКоманда.Идентификатор = ПараметрыЭтойОбработки.Имя + "_Настройка";
	НоваяКоманда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы();
	НоваяКоманда = ПараметрыРегистрации.Команды.Добавить();
	НоваяКоманда.Представление = ПараметрыЭтойОбработки.Синоним + " (регламентное задание)";
	НоваяКоманда.Идентификатор = ПараметрыЭтойОбработки.Имя + "_РегламентноеЗадание";
	НоваяКоманда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыВызовСерверногоМетода();
	Возврат ПараметрыРегистрации;
КонецФункции

Функция ПолучитьПараметрыЭтойОбработки(ВызыватьИсключение = Истина) Экспорт
	
	ИмяОбработки = ЭтотОбъект.Метаданные().Имя;
	СинонимОбработки = ЭтотОбъект.Метаданные().Синоним;
	КомментарийОбработки = ЭтотОбъект.Метаданные().Комментарий;
	Ссылка = Справочники.ДополнительныеОтчетыИОбработки.НайтиПоРеквизиту("ИмяОбъекта", ИмяОбработки);
	Если Ссылка.Пустая() Тогда
		Если ВызыватьИсключение Тогда
			ВызватьИсключение "Данная обработка не зарегистрирована в справочнике внешних обработок!";
		КонецЕсли;
	КонецЕсли;
	ПараметрыЭтойОбработки = Новый Структура;
	ПараметрыЭтойОбработки.Вставить("Ссылка", Ссылка);
	ПараметрыЭтойОбработки.Вставить("Имя", ИмяОбработки);
	ПараметрыЭтойОбработки.Вставить("Синоним", ?(ЗначениеЗаполнено(СинонимОбработки), СинонимОбработки, ИмяОбработки));
	ПараметрыЭтойОбработки.Вставить("Комментарий", КомментарийОбработки);
	Возврат ПараметрыЭтойОбработки;
КонецФункции

Процедура ВыполнитьКоманду()
	
	ПроверитьСоздатьЯчейки(Номенклатура, ДополнительноеСведение, Склад);
	ЗаполнитьРегистрРазмещенияНоменклатурыНаСервере(ДополнительноеСведение,Склад);
	
КонецПроцедуры

Процедура ПроверитьСоздатьЯчейки(Номенклатура, ДополнительноеСведение, Склад)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДополнительныеСведения.Объект КАК Номенклатура,
	               |	ДополнительныеСведения.Свойство КАК Свойство,
	               |	ДополнительныеСведения.Значение КАК ДС_НомерЯчейки,
	               |	ЕСТЬNULL(ТТМ_СкладскиеЯчейки.Ссылка, ЗНАЧЕНИЕ(Справочник.ТТМ_СкладскиеЯчейки.ПустаяСсылка)) КАК Ячейка
	               |ИЗ
	               |	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТТМ_СкладскиеЯчейки КАК ТТМ_СкладскиеЯчейки
	               |		ПО ((ВЫРАЗИТЬ(ДополнительныеСведения.Значение КАК СТРОКА(7))) = ТТМ_СкладскиеЯчейки.Код)
	               |ГДЕ
	               |	ДополнительныеСведения.Свойство = &ДополнительноеСведение";
	
	Если ЗначениеЗаполнено(Номенклатура) Тогда 
		Запрос.Текст = Запрос.Текст + " И ДополнительныеСведения.Объект = &Номенклатура";
		Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
	КонецЕсли;       
	Запрос.УстановитьПараметр("ДополнительноеСведение",ДополнительноеСведение);
	ТабЯчейкиНоменклатуры = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрТЗ из ТабЯчейкиНоменклатуры Цикл 
		Если не ЗначениеЗаполнено(СтрТЗ.Ячейка) Тогда  
			Если Справочники.ТТМ_СкладскиеЯчейки.НайтиПоКоду(СтрТЗ.ДС_НомерЯчейки) = Справочники.ТТМ_СкладскиеЯчейки.ПустаяСсылка() Тогда 
				НомерЯчейки = СтрТЗ.ДС_НомерЯчейки;        
				ПозицияРазделителя = СтрНайти(НомерЯчейки,"-");
				
				ОбъектЯчейка = Справочники.ТТМ_СкладскиеЯчейки.СоздатьЭлемент();
				ОбъектЯчейка.Владелец = Склад;
				ОбъектЯчейка.Код = СтрТЗ.ДС_НомерЯчейки;
				ОбъектЯчейка.Наименование = ОбъектЯчейка.Код;
				ОбъектЯчейка.КодСклада = Лев(СтрТЗ.ДС_НомерЯчейки,2);
				ОбъектЯчейка.НомерЯчейки = Сред(НомерЯчейки,ПозицияРазделителя+1,СтрДлина(НомерЯчейки)-ПозицияРазделителя);
				Попытка 
					ОбъектЯчейка.Записать();
					Сообщить("Ячейка создана " + НомерЯчейки + " для номенклатуры " + СтрТЗ.Номенклатура);
				Исключение
					Сообщить("Ошибка записи ячейки " + НомерЯчейки + " для номенклатуры " + СтрТЗ.Номенклатура);
				КонецПопытки;
			КонецЕсли;
		//Иначе 
			//Сообщить("Ячейка создана " + НомерЯчейки + " для номенклатуры " + СтрТЗ.Номенклатура);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьРегистрРазмещенияНоменклатурыНаСервере(ДополнительноеСведение, Склад) 
		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДополнительныеСведения.Объект КАК Номенклатура,
	               |	ДополнительныеСведения.Свойство КАК Свойство,
	               |	ЕСТЬNULL(ТТМ_СкладскиеЯчейки.Ссылка, ЗНАЧЕНИЕ(Справочник.ТТМ_СкладскиеЯчейки.ПустаяСсылка)) КАК Ячейка,
	               |	&Склад КАК Склад,
	               |	ИСТИНА КАК ОсновнаяЯчейка        
	               |ИЗ
	               |	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТТМ_СкладскиеЯчейки КАК ТТМ_СкладскиеЯчейки
	               |		ПО ((ВЫРАЗИТЬ(ДополнительныеСведения.Значение КАК СТРОКА(7))) = ТТМ_СкладскиеЯчейки.Код)
	               |ГДЕ
	               |	ДополнительныеСведения.Свойство = &ДополнительноеСведение";
	Запрос.УстановитьПараметр("ДополнительноеСведение",ДополнительноеСведение);
	Запрос.УстановитьПараметр("Склад",Склад);
	ТЗ = Запрос.Выполнить().Выгрузить();
	Для Каждого СтрТЗ из ТЗ Цикл
		//СоздатьЯчейкиНаСервере(Склад,КодСклада,,ДополнительноеСведение);
		НЗ = РегистрыСведений.ТТМ_РазмещениеНоменклатурыПоСкладскимЯчейкам.СоздатьНаборЗаписей();
		НЗ.Отбор.Номенклатура.Установить(СтрТЗ.Номенклатура);
		НЗ.Отбор.Склад.Установить(Склад);
		//НЗ.Отбор.Ячейка = СтрТЗ.Ячейка;
		НЗ.Прочитать();
		Если НЗ.Количество() <1 Тогда 
			НоваяЗапись = НЗ.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяЗапись,СтрТЗ);
		ИначеЕсли НЗ.Количество() = 1 Тогда  
			Для Каждого СтрНЗ из НЗ Цикл 
				ЗаполнитьЗначенияСвойств(СтрНЗ,СтрТЗ);
				Прервать;
			КонецЦикла;                            
		Иначе
			//Если НЗ.Количество() > 1 Тогда  
			Сообщить("Найдено более 1 ячейки для номенклатуры " + СтрТЗ.Номенклатура);
		КонецЕсли;
		НЗ.Записать();
	КонецЦикла;
	
КонецПроцедуры
